[
  {
    "client": "Psī",
    "position": "Front-End Software Engineer",
    "tech": "Git | Github | React | HTML | CSS/SASS | ES6+ Javascript | Typescript | Material UI | Google-Maps | Google Analytics | Twilio Chat",
    "details": "Psī is a mobile application that helps users navigate the complex issues of aging and caregiving for elderly loved ones, while providing significant value to Medicare Advantage (MA) health plans, employer groups, and commercial health plans. The Psī app is based on a rigorously tested face-to-face model, as well as proven telephonic advanced illness/family caregiving methods. Psī’s integrated health counseling model has demonstrated decreased hospitalizations in the senior’s last years of life, as well as improved quality of life for family caregivers and their loved ones. Utilizing a digital version of Psī’s model, MA plans will benefit from avoided hospitalizations, referrals to preferred providers, earlier hospice referrals, and reduced total costs in the last years of members’ lives. Employers and commercial health plans also can benefit from employees’ improved workplace productivity and decreased medical costs (anxiety, depression, and addiction).",
    "github-repo": null,
    "promo-image": "psi-iphone-promo.png",
    "website": "app.psilife.com"
  },
  {
    "client": "Sunny Ra",
    "position": "Full-Stack Software Engineer | UX / UI | Photographer",
    "tech": "React | HTML | Sass | Javascript | Redux | React Helmet  | PostgresSQL | Digital Ocean | Google Analytics",
    "details": "Client/Artist, Sunny Ra wanted a complete redesign of her portfolio site. I created the wireframe and designed the layout and color scheme. I photographed her portrait for the 'About' section. I then built her site using Reactjs. I made the site fully responsive using Media Queries in SASS. I used React Helmet so google would be able to crawl her site searching for keywords helping SEO (Seach Engine Optimization). I added Google Analytics so Sunny can track her traffic going to her new site.",
    "github-repo": "github.com/danlubbers/sunny-ra.com",
    "promo-image": "sunny-ra-website-apple-devices-2019.png",
    "website": "sunny-ra.com"
  }
]
